<!DOCTYPE html>
<html>
<head>
<meta name="viewport" content="width=device-width, initial-scale=1">
<style>
body {
    background-color:  rgb(216, 228, 227) ;
}

#myBtn {
  display: none;
  position: fixed;
  bottom: 20px;
  right: 30px;
  z-index: 99;
  font-size: 18px;
  border: none;
  outline: none;
  background-color:  lightseagreen;
  color:rgb(216, 228, 227) ;
  padding: 15px;
  border-radius:50%;
}


</style>
</head>
<body>

<button onclick="topFunction()" id="myBtn" title="Go to top">Top</button>

<h1 style="text-align: center"> سلام به این صفحه خوش امدید</h1>
  
  <h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
  <h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
  <h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
  <h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
  <h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
  <h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
  <h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
  <h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
  <h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>
<h1 style="color: lightseagreen">**************  پروژه بازگشت به اول صفحه با یه کلیک ********** متن  ساختگی و صرفا جهت پر کردن صفحه میباشد </h1>



<script>
// Get the button
let mybutton = document.getElementById("myBtn");

// When the user scrolls down 20px from the top of the document, show the button
window.onscroll = function() {scrollFunction()};

function scrollFunction() {
  if (document.body.scrollTop > 500 || document.documentElement.scrollTop > 500) {
    mybutton.style.display = "block";
  } else {
    mybutton.style.display = "none";
  }
}

// When the user clicks on the button, scroll to the top of the document
function topFunction() {
  document.body.scrollTop = 1;
  document.documentElement.scrollTop = 1;
}
</script>

</body>
</html>